/**   二手交易物品种类     **/
var type1 = ["种类","家具/日用品","家用电器","笔记本电脑","笔记本配件","台式电脑","网络设备","手机/通讯","手机号","数码产品","服装/鞋帽/箱包","图书/音像/软件","文体用品/乐器","母婴/儿童用品", "艺术品/收藏品", "办公用品/设备", "机械/五金", "物品交换", "免费赠送", "二手回收"];


var type2 = [
[],
["床/床垫","柜子/架子","沙发","桌/椅","日用品","其他"],
["电视","冰箱","洗衣机","空调","微波炉","厨卫电器","小型电器","音响/DVD","音响/DVD","其他"],
["IBM笔记本","三星笔记本","索尼笔记本","华硕笔记本","联想笔记本","戴尔笔记本","苹果笔记本","惠普笔记本","宏基笔记本","其他"],
["CPU","硬盘","内存","电源","散热座","电脑锁","电脑包","其他"],
[],
["路由器","交换机","网卡","宽带","防火墙","其他"],
["手机配件","诺基亚","iphone","摩托罗拉","三星","索尼爱立信","多普达","HTC","黑莓","联想","LG","夏普","天语","山寨机","其他"],
[],
["相机","摄像机","游戏机/psp","MP3/MP4/ipod","存储卡","U盘","其他"],
["服饰","箱包","鞋帽","饰品","化妆品","其他"]
];



jQuery.fn.extend({
	selected: function(val) {
        $(this).children().each(function() { 
			if($(this).attr("value")==val){
				$(this).attr("selected","selected");
			}
		}); 
    },
	initializeType1: function() {
		for(var i=0;i<type1.length;i++){
			$(this).append("<option value="+i+">"+type1[i]+"</option>");
		}
    }
	
}); 