var vocation =['销售','人力资源','计算机/网络/通信','超市/百货/零售','行政/后勤','咨询/顾问','酒店/餐饮','市场/公关/媒介','医药/生物工程','技工/工人','教育/培训','金融/银行/投资/基金/证券','客服','中介服务','广告/会展','司机','保险','美术/设计/创意','生产/制造','汽车销售与服务','物业管理/商业中心','建筑/装修','医院/医疗/护理','财务/审计/税务','保健按摩','美容美发','运动健身','家政','旅游','法律','贸易/交通/运输/物流','机械/仪器仪表','电气/能源/动力','媒体/影视/文化','石油/石化/化工','翻译','编辑/出版/印刷','环保','学术/科研','农/林/牧/渔','毕业生/实习生/培训生']

var position =[['电话销售','销售代表/客户经理','售前工程师','团购业务员','医药代表','汽车销售','销售助理','销售主管/经理','商务主管/经理','区域主管/渠道经理','大客户经理','销售总经理/总监','其他职位'],['人事专员/助理','招聘专员/助理','薪资福利专员/助理','绩效考核专员/助理','培训专员/助理','猎头顾问','人事主管/经理','招聘主管/经理','薪资福利主管/经理','绩效考核主管/经理','培训主管/经理','人事总监','其他职位'],['技术支持/维护','软件工程师','硬件工程师','质量工程师','系统工程师','测试工程师','系统架构师','数据库管理/DBA','游戏设计/开发','网页设计/制作','语音/视频/图形','网站运营','网站编辑','网络管理员','网络安全工程师','通信技术工程师','需求分析师','项目经理','产品经理/专员','技术经理/总监','其他职位'],['营业员/店员','导购','收银员','理货员/陈列员','采购员/助理','食品加工/处理','防损员/内保','仓库管理员','技工/工人','保洁','保安','店长/卖场经理','其他职位'],['行政专员/助理','经理助理/秘书/文员','前台/总机/接待','后勤','行政主管/经理','行政总监','其他职位'],['专业/企管顾问','咨询员','调研员','培训师/讲师','涉外咨询师','咨询经理','咨询总监','其他职位'],['服务员','厨师','面点师','茶艺师','切配工','传菜员','洗碗工','杂工','收银员','领班','迎宾/礼仪','保安','预订员','调酒师/吧台员','主持/司仪','预订部主管','大堂经理','宾客服务经理','楼面经理','其他职位'],['市场专员/经理','市场策划专员/经理','市场营销专员/经理','市场调研与分析','公关媒介专员/经理','会务专员/经理','品牌专员/经理','促销专员/经理','广告创意/设计/文案','市场总监','其他职位'],['医药代表','医疗器械推广','产品研发/注册','生物工程/制药','临床研究/协调','项目主管/经理','药品生产/质量管理','招商主管/经理','其他职位'],['普工/学徒工','电工','木工','焊工','水工','油漆工','建筑工人','水泥工','钢筋工','管道工','瓦工','洗车工','汽车/摩托车修理工','机电维修工','电器维修工','锅炉工','水暖工','车工','铣工','模具工','钳工','钣金工','切割技工','操作工','搬运工','送水工','叉车工/铲车工','组装工','包装工','印刷工','缝纫工','样衣工','染工','纺织工','印花工','压熨工','其他职位'],['教师','助教','家教','幼教','培训师/讲师','教育产品开发','培训策划','教学/教务管理人员','其他职位'],['证券/期货经纪人','银行会计/柜员','投资/理财顾问','信贷管理/资信评估','风险管理/控制','股票/期货操盘手','证券分析师','证券经理','银行主任/经理','外汇/基金/国债经理','融资经理','其他职位'],['客服专员/助理','呼叫中心人员','售后支持工程师','客服主管/经理','客户关系管理','售后支持主管/经理','客服总监','其他职位'],['房地产经纪人','其他经纪人','房地产内勤','其他职位'],['客户主管/专员','业务拓展 ','会展策划/设计','企业策划人员','文案策划','婚礼策划服务','美术指导','制作执行','项目管理','媒介策划/管理','设计/创意管理','客户经理/总监','其他职位'],['商务司机','客运司机','货运司机','出租车司机','班车司机','特种车司机','驾校教练/陪练','其他职位'],['保险经纪人','保险精算师','保险核保/理赔','保险客户服务/续期管理','保险培训师','储备经理人','保险产品开发/项目策划','保险内勤','契约管理','保险业务主管/经理','其他职位'],['美术编辑/设计','产品/包装设计','展示/装潢设计','平面设计','家具设计','多媒体/动画设计','工艺品/珠宝设计','店面/陈列/展览设计','印刷排版/制版','设计管理人员','CAD设计/制图','创意指导/总监','其他职位'],['技工/工人','跟单员','采购员/助理','仓库管理员','技术/工艺设计','化验/检验','质量管理','设备管理维护','计划调度','技术工程师','生产主管/组长','车间主任','厂长/副厂长','总工程师','其他职位'],['汽车销售','汽车/摩托车修理工','售后/客户服务','零配件销售','装饰美容','检验检测','二手车评估师','4S店管理','其他职位'],['物业顾问','物业招商/租赁/租售','物业维修','物业管理','物业设施管理','其他职位'],['建筑/建造师','结构/土木土建工程师','建筑设计/制图','岩土工程师','幕墙工程师','建筑工程验收','测量员/测绘员','房地产开发/策划','房地产项目招投标专员','给排水/强电/弱电/制冷暖通','房地产评估','房地产销售','设备工程师','造价员/预算员','路桥/隧道/港口/航道工程','园艺/园林/景观设计','室内外装潢设计','城市规划与设计','公路桥梁设计/预算师','施工员/安全员','材料员/资料员','建筑工程管理','高级建筑工程师','工程监理','其他职位'],['内科医生','外科医生','专科医生','牙科医生','麻醉医生','美容整形师','理疗师','中医科医生','针灸推拿','儿科医生','心理医生','营养师','医药学检验','护士/护理人员','公共卫生/疾病控制','兽医','验光师','药剂师/药库主任','护理主任/护士长','医院管理人员','其他职位'],['财务/会计助理','会计','出纳','财务分析员','成本管理员','审计专员/助理','统计','税务专员/助理','资产/资金管理','财务/总账主管','财务经理','会计主管/经理','财务分析主管/经理','成本主管/经理','审计主管/经理','税务主管/经理','财务总监','其他职位'],['按摩师','足疗师','针灸推拿','其他职位'],['美发师','美容师','美发助理','美容助理','化妆师','美甲师','美体师','店长','其他职位'],['健身顾问/教练','瑜伽教练','瘦身顾问','舞蹈老师','其他职位'],['保姆/护工','月嫂/育婴','保洁','小时工/钟点工','洗衣工','其他职位'],['导游','客运司机','客服','计调','翻译','订票/订房服务','其他职位'],['律师','法律顾问','律师助理','法务人员','知识产权/专利顾问','其他职位'],['货运司机','技工/工人','仓库管理员','报关员','跟单员','采购员/助理','快递员','调度员','安检员','物流专员/助理','陆/海/空运人员','外贸专员/经理','国内贸易专员/经理','采购主管/经理','物流主管/经理','其他职位'],['机械工程师','模具工程师','机械设计师','机械制图员','机电工程师','精密机械/仪器仪表工程师','铸造/锻造工程师','注塑工程师','CNC工程师','冲压工程师','夹具工程师','锅炉工程师','焊接工程师','汽车/摩托车工程师','船舶工程师','飞行器设计与制造','机械维修工程师','包装/印刷机械','食品机械','纺织机械','设备维修','其他职位'],['电气工程师','光源与照明工程师','变压器与磁电工程师','电路工程师','智能大厦/综合布线/弱电','电力工程师','电气维修技术员','水利/水电工程师','核力/火力工程师','燃气轮机工程师','空调/热能工程师','石油天然气技术人员','自动控制','其他职位'],['音乐/表演/主持','编导','配音','影视策划','摄像','后期制作','化妆师','助理','校对/录入','编辑/记者/撰稿人','排版/印刷','其他职位'],['石油/化工技术','加油员','其他职位'],['英语翻译','日语翻译','韩语翻译','德语翻译','法语翻译','俄语翻译','其他语种'],['编辑/记者/撰稿人','校对/录入','出版/发行','排版/印刷','装订/烫金','主编/总编','其他职位'],['污水处理工程师','环境工程技术/园林景区','环保技术','环境管理/保护','EHS管理','其他职位'],['科研人员','科研管理人员','其他职位'],['农/林/牧/渔','饲料业务','养殖人员','农艺师','畜牧师','其他职位'],['志愿者','培训生','实习生','毕业生','储备干部','其他职位'],]

var type = ['国企','民营','外企','合资','事业单位','机关单位','代表处','其他'];

var scale = ['50人以下','50-100','100-200','200-500','500-1000','1000人以上'];

var degree = ['不限','初中','高中','大专','本科','硕士','博士'];

var years = ['1年以下','1-3年','3-5年','5-10年','10年以上'];

var salary = ['2000以下','2000-3000','3000-5000','5000-10000','10000以上'];


jQuery.fn.extend({
	selected: function(val) {
        $(this).children().each(function() { 
			if($(this).attr("value")==val){
				$(this).attr("selected","selected");
			}
		}); 
    },
	initializeVocation: function() {
		for(var i=0;i<vocation.length;i++){
			$(this).append("<option value="+i+">"+vocation[i]+"</option>");
		}
    },
	initializeType: function() {
		for(var i=0;i<type.length;i++){
			$(this).append("<option value="+i+">"+type[i]+"</option>");
		}
    },
	initializeScale: function() {
		for(var i=0;i<scale.length;i++){
			$(this).append("<option value="+i+">"+scale[i]+"</option>");
		}
    },
	initializeDegree: function() {
		for(var i=0;i<degree.length;i++){
			$(this).append("<option value="+i+">"+degree[i]+"</option>");
		}
    },
	initializeYears: function() {
		for(var i=0;i<years.length;i++){
			$(this).append("<option value="+i+">"+years[i]+"</option>");
		}
    },
	initializeSalary: function() {
		for(var i=0;i<salary.length;i++){
			$(this).append("<option value="+i+">"+salary[i]+"</option>");
		}
    },
	initializePosition: function(index) {
		var p = position[index];
		for(var i=0;i<p.length;i++){
			$(this).append("<option value="+i+">"+p[i]+"</option>");
		}
    }
	
	
	
}); 